---
kind: property
id: P:Autodesk.Revit.DB.MultiReferenceAnnotationType.ShowDimensionText
source: html/48eb0247-c2f6-ea03-b347-f9d999662428.htm
---
# Autodesk.Revit.DB.MultiReferenceAnnotationType.ShowDimensionText Property

Controls if text from the multi-reference annotation's dimension will be shown.

## Syntax (C#)
```csharp
public bool ShowDimensionText { get; set; }
```